app/controllers/rest_controller.rb

SELECT `transactions`.* FROM `transactions` WHERE (refno='996105314170' and orderno='1348112705') LIMIT 1
---
      tref=ele.get_text('a:TransactionRefNo').to_s
      mref=ele.get_text('a:MerchantReference').to_s

      trrec= Transactions.where("refno=? and orderno=?",tref,mref).limit(1).first #search in transaction table

SELECT `receipts`.* FROM `receipts` WHERE (TransactionRefNo = '996105314170' and MerchantReference =1348112705 ) LIMIT 1
---
  def receipt

    if !session[:order].present? ||!session[:tref].present?
      render :text=>'Session expired'
    else
      rec=Receipts.new
      @receipt=  Receipts.where("TransactionRefNo = ? and MerchantReference =? ",session[:tref],session[:order]).limit(1).first