app/controllers/wsdl_controller.rb

  def notify

    require 'MerchantAPIServiceDriver.rb'

    obj = MerchantAPIService.new
config=Rails.application.config
    token=params[:Token]
  trns=GetTransaction.new
   req=GetTransactionRequest.new
  req.authenticationCode=config.wsdl_authcode
  req.merchantCode=config.wsdl_merchantcode
  req.transactionToken=token
  trns.request=req


  res=    obj.getTransaction(trns)
  gtr=  res.getTransactionResult

if gtr.errors.length>0
---
SELECT `transactions`.* FROM `transactions` WHERE (refno='996105314169' and orderno='1348110451') LIMIT 1

  def receipt

    if !session[:order].present? ||!session[:tref].present?
     render :text=>'Session expired'
    else
      rec=Receipts.new
    @receipt=  Receipts.where("TransactionRefNo = ? and MerchantReference =? ",session[:tref],session[:order]).limit(1).first
---
SELECT `receipts`.* FROM `receipts` WHERE (TransactionRefNo = '996105314169' and MerchantReference =1348110451 ) LIMIT 1